In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [2]:
df = pd.read_csv("cars.csv")

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8128 entries, 0 to 8127
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   brand          8128 non-null   object
 1   km_driven      8128 non-null   int64
 2   fuel           8128 non-null   object
 3   owner          8128 non-null   object
 4   selling_price  8128 non-null   int64
dtypes: int64(2), object(3)
memory usage: 317.6+ KB

In [5]:
df.head(2)

    brand  km_driven    fuel         owner  selling_price
0  Maruti     145500  Diesel   First Owner         450000
1   Skoda     120000  Diesel  Second Owner         370000

In [6]:
#### Dummy variable trap (n catagories = n-1 catagories, reason for this multi co-linearnity)

In [15]:
#### OHE using frequent variable( in brand column we have 32 nominal variables )

In [14]:
df['brand'].nunique()

32

In [16]:
df['owner'].value_counts()

First Owner             5289
Second Owner            2105
Third Owner              555
Fourth & Above Owner     174
Test Drive Car             5
Name: owner, dtype: int64

In [17]:
### in pandas get  get dummies for nominal catagories

In [18]:
df.columns

Index(['brand', 'km_driven', 'fuel', 'owner', 'selling_price'], dtype='object')

In [30]:
pd.get_dummies(df, columns=['fuel', 'owner']).head()

,brand,km_driven,selling_price,fuel_CNG,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,0,1,0,0,1,0,0,0,0
1,Skoda,120000,370000,0,1,0,0,0,0,1,0,0
2,Honda,140000,158000,0,0,0,1,0,0,0,0,1
3,Hyundai,127000,225000,0,1,0,0,1,0,0,0,0
4,Maruti,120000,130000,0,0,0,1,1,0,0,0,0

In [28]:
ds.columns

Index(['brand', 'km_driven', 'selling_price', 'fuel_CNG', 'fuel_Diesel',
       'fuel_LPG', 'fuel_Petrol', 'owner_First Owner',
       'owner_Fourth & Above Owner', 'owner_Second Owner',
       'owner_Test Drive Car', 'owner_Third Owner'],
      dtype='object')

In [31]:
## K-1 onecodings
pd.get_dummies(df, columns=['fuel', 'owner'], drop_first=True)

,brand,km_driven,selling_price,fuel_Diesel,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti,145500,450000,1,0,0,0,0,0,0
1,Skoda,120000,370000,1,0,0,0,1,0,0
2,Honda,140000,158000,0,0,1,0,0,0,1
3,Hyundai,127000,225000,1,0,0,0,0,0,0
4,Maruti,120000,130000,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...
8123,Hyundai,110000,320000,0,0,1,0,0,0,0
8124,Hyundai,119000,135000,1,0,0,1,0,0,0
8125,Maruti,120000,382000,1,0,0,0,0,0,0
8126,Tata,25000,290000,1,0,0,0,0,0,0
8127,Tata,25000,290000,1,0,0,0,0,0,0

In [32]:
### onehotencoding fron sklearn

In [33]:
from sklearn.model_selection import train_test_split

In [34]:
X_train, X_test, y_train, y_test = train_test_split(df.iloc[:,0:4], df.iloc[:,-1], test_size=0.2)

In [45]:
X_train.head()

        brand  km_driven    fuel        owner
2885   Maruti      60000  Petrol  First Owner
1321  Hyundai      40000  Petrol  First Owner
6416   Maruti     114000  Petrol  First Owner
6179  Hyundai      56290  Diesel  First Owner
1687  Hyundai      29000  Petrol  First Owner

In [39]:
from sklearn.preprocessing import OneHotEncoder

In [58]:
ohe = OneHotEncoder(drop="first") #spare=False, dtype = np.int32  #for numpy array & integer type

In [59]:
X_train_new = ohe.fit_transform(X_train[['fuel', 'owner']]).toarray()
X_train_new

array([[0., 0., 1., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.],
       ...,
       [1., 0., 0., ..., 1., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.],
       [0., 0., 1., ..., 0., 0., 0.]])

In [60]:
X_test_new = ohe.fit_transform(X_test[['fuel', 'owner']]).toarray()

In [61]:
X_train[['brand', 'km_driven']].values

array([['Maruti', 60000],
       ['Hyundai', 40000],
       ['Maruti', 114000],
       ...,
       ['Mahindra', 65100],
       ['Tata', 14000],
       ['Maruti', 50000]], dtype=object)

In [62]:
np.hstack((X_train[['brand', 'km_driven']].values, X_train_new))

array([['Maruti', 60000, 0.0, ..., 0.0, 0.0, 0.0],
       ['Hyundai', 40000, 0.0, ..., 0.0, 0.0, 0.0],
       ['Maruti', 114000, 0.0, ..., 0.0, 0.0, 0.0],
       ...,
       ['Mahindra', 65100, 1.0, ..., 1.0, 0.0, 0.0],
       ['Tata', 14000, 1.0, ..., 0.0, 0.0, 0.0],
       ['Maruti', 50000, 0.0, ..., 0.0, 0.0, 0.0]], dtype=object)

In [63]:
np.hstack((X_train[['brand', 'km_driven']].values, X_train_new)).shape

(6502, 9)

In [ ]:
##### One hot encoding with Top catagories

In [68]:
df['brand'].nunique()

32

In [70]:
df['brand'].value_counts()

Maruti           2448
Hyundai          1415
Mahindra          772
Tata              734
Toyota            488
Honda             467
Ford              397
Chevrolet         230
Renault           228
Volkswagen        186
BMW               120
Skoda             105
Nissan             81
Jaguar             71
Volvo              67
Datsun             65
Mercedes-Benz      54
Fiat               47
Audi               40
Lexus              34
Jeep               31
Mitsubishi         14
Force               6
Land                6
Isuzu               5
Kia                 4
Ambassador          4
Daewoo              3
MG                  3
Ashok               1
Opel                1
Peugeot             1
Name: brand, dtype: int64

In [71]:
count = df['brand'].value_counts()

In [72]:
threshold =100

In [73]:
count[count <= threshold].index

Index(['Nissan', 'Jaguar', 'Volvo', 'Datsun', 'Mercedes-Benz', 'Fiat', 'Audi',
       'Lexus', 'Jeep', 'Mitsubishi', 'Force', 'Land', 'Isuzu', 'Kia',
       'Ambassador', 'Daewoo', 'MG', 'Ashok', 'Opel', 'Peugeot'],
      dtype='object')

In [74]:
repl = count[count <= threshold].index

In [75]:
pd.get_dummies(df['brand'].replace(repl, 'uncommon')).sample(5)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,uncommon
5365,0,0,0,0,0,0,0,1,0,0,0,0,0
5342,0,0,0,0,0,0,0,0,0,0,0,0,1
1680,0,0,0,0,0,0,1,0,0,0,0,0,0
3184,0,0,0,0,0,1,0,0,0,0,0,0,0
2288,0,0,0,0,1,0,0,0,0,0,0,0,0